v2206/MSc_icedAirfoil/Meshing_ice_1/+05deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       38348;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       38372;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       38396;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       38444;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19140;
        startFace       38492;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19140;
        startFace       57632;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          745;
        startFace       76772;
    }
)

// ************************************************************************* //
